## Pivot
- 데이터 프레임 컬럼데이터에서 특정 컬럼의 데이터를 index, columns, values를 선택하여 프레임을 만드는 방법입니다.
- df.pivot(index, columns, values)

In [2]:
import pandas as pd
import numpy as np

In [3]:
#타이타닉데이터
#survived - 0:no, 1:yes
titanic = pd.read_csv('train.csv')
titanic.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

### 성별에 따른 등급부터 만들자
    등급    1     2     3
     -------------------------------
성별  female 000   000   000   
     male   000   000   000

In [4]:
#중복데이터는 groupby로 중복을 없애주고 pivot을 사용해야한다.
#groupby

titanic_df1 = titanic.groupby(["Sex", "Pclass"]).size().reset_index(name="Counts")
titanic_df1

      Sex  Pclass  Counts
0  female       1      94
1  female       2      76
2  female       3     144
3    male       1     122
4    male       2     108
5    male       3     347

In [5]:
titanic_df1 = titanic_df1.pivot("Sex","Pclass","Counts")
titanic_df1

Pclass    1    2    3
Sex
female   94   76  144
male    122  108  347

# 이번엔 생존데이터를 만들어보자
### 성별에 따른 생존자수를 나타내는 데이터프레임

생존  0   1
성별
-------------------
female 000 000
male 000 000

In [6]:
titanic_df2 = titanic.groupby(["Sex","Survived"]).size().reset_index(name = "Counts")
titanic_df2

      Sex  Survived  Counts
0  female         0      81
1  female         1     233
2    male         0     468
3    male         1     109

In [7]:
titanic_df2 = titanic_df2.pivot("Sex","Survived","Counts")
titanic_df2

Survived    0    1
Sex
female     81  233
male      468  109

In [8]:
#객실등급에 따른 생존자수

titanic_df3 = titanic.groupby(["Pclass","Survived"]).size().reset_index(name="Counts")
titanic_df3

   Pclass  Survived  Counts
0       1         0      80
1       1         1     136
2       2         0      97
3       2         1      87
4       3         0     372
5       3         1     119

In [9]:
titanic_df3 = titanic_df3.pivot("Pclass","Survived","Counts")
titanic_df3

Survived    0    1
Pclass
1          80  136
2          97   87
3         372  119

## pivot table

- 위에서는 먼저 groupby로 정리하고 pivot했지만, 이것은 한방에 해치운다.
- pivot_table(values, index, columns, aggfunc)
- fill_value : NaN 데이터를 설정한 데이터로 치환해주는 파라미터

- dropna(True) : NaN 데이터컬럼을 놔둘지 제거할지 결정한다.

In [10]:
titanic["Counts"] = 1
titanic.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Counts
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S,1
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S,1
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C,1
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,1

In [11]:
a = titanic.pivot_table("Counts",["Sex"], ["Pclass"], aggfunc=np.sum)
a

Pclass    1    2    3
Sex
female   94   76  144
male    122  108  347

In [13]:
def age_sep(num):
    return (num // 10) *10

titanic["Ages"] = titanic["Age"].apply(age_sep)
titanic.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Counts,Ages
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S,1,20.0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S,1,10.0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S,1,NaN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C,1,20.0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,1,30.0

In [20]:
tidf1 = titanic#.dropna(subset=["Age","Ages"]).reset_index(drop=True)

In [21]:
tidf1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Counts,Ages
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,20.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,30.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,20.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,30.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,30.0
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,1,NaN
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,1,50.0
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,1,0.0
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S,1,20.0
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,1,10.0
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S,1,0.0
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S,1,50.0
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S,1,20.0
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S,1,30.0
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S,1,10.0
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S,1,50.0
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q,1,0.0
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S,1,NaN
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S,1,30.0
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C,1,NaN
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S,1,30.0
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S,1,30.0
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q,1,10.0
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S,1,20.0
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S,1,0.0
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S,1,30.0
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C,1,NaN
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S,1,10.0
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q,1,NaN
29,30,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,NaN,S,1,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
861,862,0,2,"Giles, Mr. Frederick Edward",male,21.0,1,0,28134,11.5000,NaN,S,1,20.0
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S,1,40.0
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S,1,NaN
864,865,0,2,"Gill, Mr. John William",male,24.0,0,0,233866,13.0000,NaN,S,1,20.0
865,866,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,236852,13.0000,NaN,S,1,40.0
866,867,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C,1,20.0
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S,1,30.0
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S,1,NaN
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S,1,0.0
870,871,0,3,"Balkic, Mr. Cerin",male,26.0,0,0,349248,7.8958,NaN,S,1,20.0
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S,1,40.0
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S,1,30.0
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S,1,40.0
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C,1,20.0
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C,1,10.0
876,877,0,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,9.8458,NaN,S,1,20.0
877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S,1,10.0
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S,1,NaN
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C,1,50.0
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S,1,20.0
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S,1,30.0
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S,1,20.0
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S,1,20.0
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S,1,20.0
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q,1,30.0
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1,20.0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,10.0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,1,NaN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1,20.0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1,30.0

In [34]:
k = tidf1.pivot_table("Counts",["Pclass","Sex"],["Ages"], aggfunc=np.sum, fill_value=0)
k

Ages           0.0   10.0  20.0  30.0  40.0  50.0  60.0  70.0  80.0
Pclass Sex
1      female     1    13    16    27    13    12     3     0     0
       male       2     5    18    23    24    15    10     3     1
2      female     8     8    25    17    10     6     0     0     0
       male       9    10    28    31     8     9     3     1     0
3      female    21    24    31    16     9     0     1     0     0
       male      21    42   102    53    25     6     2     2     0

In [40]:
#pivot_table로 성별에 따른 생존자 수를 뽑아보자
A = titanic.pivot_table("Counts",["Sex"],["Survived"], aggfunc=np.sum)
A

Survived    0    1
Sex
female     81  233
male      468  109

In [41]:
#pivot_table로 좌석등급에 따른 생존자 수도 뽑아보자
B = titanic.pivot_table("Counts",["Pclass"],["Survived"], aggfunc=np.sum)
B

Survived    0    1
Pclass
1          80  136
2          97   87
3         372  119

In [42]:
df = titanic.pivot_table("Counts", ["Sex","Pclass"], ["Survived"], aggfunc=np.sum)
df

Survived         0   1
Sex    Pclass
female 1         3  91
       2         6  70
       3        72  72
male   1        77  45
       2        91  17
       3       300  47

---

In [43]:
df = titanic.pivot_table("Counts",["Survived"],["Sex"],aggfunc=np.sum)
df

Sex       female  male
Survived
0             81   468
1            233   109

In [55]:
df["total"] = df["female"] + df["male"]
df

Sex       female  male  total
Survived
0             81   468    549
1            233   109    342

In [56]:
df.loc["total"] = df.loc[0] + df.loc[1]
df

Sex       female  male  total
Survived
0             81   468    549
1            233   109    342
total        314   577    891

In [57]:
#total데이터행을 drop으로 삭제해보자
df.drop("total", inplace=True) #axis =0 일때는 행을 삭제한다
df

Sex       female  male  total
Survived
0             81   468    549
1            233   109    342

In [58]:
#이번에는 total데이터 열을 drop으로 삭제해보자
df.drop("total", inplace=True, axis = 1) #axis =0 일때는 행을 삭제한다
df

Sex       female  male
Survived
0             81   468
1            233   109

---

In [61]:
#fill_value (NaN 데이터 대신 넣어줄 값을 정하는 설정)

df = titanic.pivot_table("Counts",["Survived"],["Parch","Pclass"], aggfunc=np.sum, fill_value=0)
df

Parch      0            1           2          3     4     5  6
Pclass     1   2    3   1   2   3   1   2   3  2  3  1  3  3  3
Survived
0         64  86  295  10   8  35   5   3  32  0  2  1  3  4  1
1         99  48   86  21  24  20  16  13  11  2  1  0  0  1  0

In [63]:
#dropna (NaN값으로만 이루어진 행과 열을 그냥 제거할지 여부 결정 = False면 남긴다.)

df = titanic.pivot_table("Counts",["Survived"],["Parch","Pclass"], aggfunc=np.sum, dropna=False)
df

Parch        0                  1                 2               3 ...        \
Pclass       1     2      3     1     2     3     1     2     3   1 ...     3
Survived                                                            ...
0         64.0  86.0  295.0  10.0   8.0  35.0   5.0   3.0  32.0 NaN ...   2.0
1         99.0  48.0   86.0  21.0  24.0  20.0  16.0  13.0  11.0 NaN ...   1.0

Parch       4            5            6
Pclass      1   2    3   1   2    3   1   2    3
Survived
0         1.0 NaN  3.0 NaN NaN  4.0 NaN NaN  1.0
1         NaN NaN  NaN NaN NaN  1.0 NaN NaN  NaN

[2 rows x 21 columns]